In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('18_analise_avancada.csv')
df

   Turma  Matemática  Ciências
0      C          83        96
1      A          47        91
2      C          63        52
3      C          50        80
4      A          90        42
..   ...         ...       ...
95     A          78        79
96     A          72        78
97     C          40        57
98     A          96        79
99     A          66        40

[100 rows x 3 columns]

In [7]:
media = df.groupby('Turma').mean()
media

       Matemática   Ciências
Turma
A       69.515152  70.393939
B       70.888889  71.555556
C       68.741935  67.580645

In [9]:
mediana = df.groupby('Turma').median()
mediana

       Matemática  Ciências
Turma
A            68.0      72.0
B            71.0      72.0
C            74.0      67.0

In [ ]:
moda = df.groupby('Turma')[['Matemática', 'Ciências']].agg(lambda x: x.mode().iloc[0])
moda

       Matemática  Ciências
Turma
A              94        71
B              54        58
C              78        42

In [17]:
amplitude = df.groupby('Turma').agg(lambda x: x.max() - x.min())
amplitude

       Matemática  Ciências
Turma
A              57        58
B              53        58
C              60        57

In [19]:
variancia = df.groupby(['Turma']).var()
variancia

       Matemática    Ciências
Turma
A      325.570076  345.996212
B      234.101587  374.311111
C      307.997849  347.318280

In [21]:
desv_pad = df.groupby('Turma')[['Matemática', 'Ciências']].std()
desv_pad

       Matemática   Ciências
Turma
A       18.043561  18.600973
B       15.300379  19.347122
C       17.549868  18.636477

In [25]:
covariancia = df.groupby(['Turma']).cov()
covariancia

                  Matemática    Ciências
Turma
A     Matemática  325.570076  -68.646780
      Ciências    -68.646780  345.996212
B     Matemática  234.101587  -25.165079
      Ciências    -25.165079  374.311111
C     Matemática  307.997849   77.054839
      Ciências     77.054839  347.318280

In [26]:
correlacao = df.groupby(['Turma']).corr()
correlacao

                  Matemática  Ciências
Turma
A     Matemática    1.000000 -0.204532
      Ciências     -0.204532  1.000000
B     Matemática    1.000000 -0.085012
      Ciências     -0.085012  1.000000
C     Matemática    1.000000  0.235593
      Ciências      0.235593  1.000000

### Com base nas medidas acima, qual turma teve o melhor desempenho geral em Matemática e Ciências?
##### Resposta: A turma B teve o melhor desempenho geral, pois ficou com a média superior em comparação com as outras turmas.

### Qual turma tem as notas mais consistentes em termos de desvio padrão?
##### Resposta: A turma B possui as notas mais consistentes, apresentando um menor desvio padrão, significando que as notas dos alunos dessa turma variam menos do que as dos alunos de outras turmas

### Existe uma correlação entre o desempenho em Matemática e Ciências para cada turma? Essa correlação é positiva ou negativa?
##### Resposta:  Na turma A, a correlação negativa indica que os alunos com melhor desempenho em matemática tendem a ter pior desempenho em ciencias e vice-versa.A turma B possui uma correlação muito baixa entre as disciplinas. Já a turma C a correlação é positiva, significando que os alunos vão bem em ambas as disciplinas

### Qual turma apresenta a maior amplitude de notas? O que isso nos diz sobre a desigualdade de desempenho dentro da turma?
##### Resposta: A maior amplitude de notas está presenta na turma C, indicando que há uma grande diferença entre as notas mais altas e mais baixas, significando que a turma possui alunos com diferentes niveis de desempenho.